hammer-dp-ua/WiFiMotionDetector-STM32/app/main.c
         unsigned short current_piped_task_to_send = get_current_piped_task_to_send();

         if (send_usart_data_function == NULL && current_piped_task_to_send) {
            if (current_piped_task_to_send == DISABLE_ECHO_FLAG) {
               execute_usart_data_sending(disable_echo, 2);
            } else if (current_piped_task_to_send == OBTAIN_CONNECTION_STATUS_FLAG) {
               execute_usart_data_sending(get_connection_status, 2);
            } else if (current_piped_task_to_send == GET_VISIBLE_NETWORK_LIST_FLAG) {
               execute_usart_data_sending(get_network_list, 30);
            } else if (current_piped_task_to_send == CONNECT_TO_NETWORK_FLAG) {
               execute_usart_data_sending(connect_to_network, 10);
            } else if (current_piped_task_to_send == CONNECT_TO_SERVER_FLAG) {
               execute_usart_data_sending(connect_to_server, 2);
            } else if (current_piped_task_to_send == BYTES_TO_SEND_IN_REQUEST_IS_SET_FLAG) {
               execute_usart_data_sending(set_bytes_amount_to_send, 2);
            } else if (current_piped_task_to_send == GET_REQUEST_SENT_AND_RESPONSE_RECEIVED_FLAG) {
               execute_usart_data_sending(send_request, 2);
            } else if (current_piped_task_to_send == GET_CURRENT_DEFAULT_WIFI_MODE_FLAG) {
               execute_usart_data_sending(get_current_default_wifi_mode, 2);
            } else if (current_piped_task_to_send == SET_DEFAULT_STATION_WIFI_MODE_FLAG) {
               execute_usart_data_sending(set_default_wifi_mode, 2);
            }
         }

         // LED blinking
         if (network_searching_status_led_counter >= TIMER3_100MS && !read_flag_state(&general_flags, SUCCESSUFULLY_CONNECTED_TO_NETWORK_FLAG)) {
            network_searching_status_led_counter = 0;

            if (read_flag_state(&general_flags, NETWORK_SEARCHING_STATUS_LED_FLAG)) {
               reset_flag(&general_flags, NETWORK_SEARCHING_STATUS_LED_FLAG);
               GPIO_WriteBit(NETWORK_STATUS_LED_PORT, NETWORK_STATUS_LED_PIN, Bit_SET);
            } else {
               set_flag(&general_flags, NETWORK_SEARCHING_STATUS_LED_FLAG);
               GPIO_WriteBit(NETWORK_STATUS_LED_PORT, NETWORK_STATUS_LED_PIN, Bit_RESET);
            }
         }

         if (response_timeout_timer > TIMER6_10S && !current_piped_task_to_send) {
            response_timeout_timer = 0;

            if (read_flag_state(&general_flags, SENDING_USART_ERRORS_OVERFLOW_FLAG)) {
               reset_flag(&general_flags, SENDING_USART_ERRORS_OVERFLOW_FLAG);

               char request_template[] = "GET /extjs/5errors.txt HTTP/1.1\r\nHost: {1}\r\nUser-Agent: ESP8266\r\nAccept: text/html\r\nConnection: close\r\n\r\n";
               char *parameter_for_request[] = {"192.168.0.2", NULL};
               char *request = set_string_parameters(request_template, parameter_for_request);
               send_usart_get_request("192.168.0.2", "80", request, action_on_response);
            } else {
               char request_template[] = "GET /extjs/tmp.txt HTTP/1.1\r\nHost: {1}\r\nUser-Agent: ESP8266\r\nAccept: text/html\r\nConnection: close\r\n\r\n";
               char *parameter_for_request[] = {"192.168.0.2", NULL};
               char *request = set_string_parameters(request_template, parameter_for_request);
               send_usart_get_request("192.168.0.2", "80", request, action_on_response);
            }
         }

         if (send_usart_data_errors_counter > 5) {
            set_flag(&general_flags, SENDING_USART_ERRORS_OVERFLOW_FLAG);
            send_usart_data_errors_counter = 0;

            delete_all_piped_tasks();
            clear_piped_request_commands_to_send();
            on_response = NULL;
            send_usart_data_function = NULL;

            successfully_received_flags = 0;
            sent_flag = 0;
         }
      } else if (esp8266_disabled_counter >= TIMER6_1S) {
         esp8266_disabled_counter = 0;
         enable_esp8266();
      }
   }
}

void get_current_default_wifi_mode() {
   send_usard_data(ESP8226_REQUEST_GET_CURRENT_DEFAULT_WIFI_MODE);
   set_flag(&sent_flag, GET_CURRENT_DEFAULT_WIFI_MODE_FLAG);
}

void set_default_wifi_mode() {
   send_usard_data(ESP8226_REQUEST_SET_DEFAULT_STATION_WIFI_MODE);
   set_flag(&sent_flag, SET_DEFAULT_STATION_WIFI_MODE_FLAG);
}

void action_on_response() {
   clear_piped_request_commands_to_send();
}

/**
 * address, port and request shall be allocated with malloc. Later they will be removed with free
 */
void send_usart_get_request(char address[], char port[], char request[], void (*execute_on_response)()) {
   clear_piped_request_commands_to_send();
   char *parameters[] = {address, port, NULL};
   piped_request_commands_to_send[PIPED_REQUEST_CIPSTART_COMMAND_INDEX] = set_string_parameters(ESP8226_REQUEST_CONNECT_TO_SERVER, parameters);

   unsigned short request_length = get_string_length(request);
   char *request_length_string = short_to_string(request_length);
   char *start_sending_parameters[] = {request_length_string, NULL};
   piped_request_commands_to_send[PIPED_REQUEST_CIPSEND_COMMAND_INDEX] = set_string_parameters(ESP8226_REQUEST_START_SENDING, start_sending_parameters);
   free(request_length_string);
   piped_request_commands_to_send[PIPED_REQUEST_INDEX] = request;

   on_response = execute_on_response;

   add_piped_task_to_send_into_tail(CONNECT_TO_SERVER_FLAG);
   add_piped_task_to_send_into_tail(BYTES_TO_SEND_IN_REQUEST_IS_SET_FLAG);
   add_piped_task_to_send_into_tail(GET_REQUEST_SENT_AND_RESPONSE_RECEIVED_FLAG);
}

void clear_piped_request_commands_to_send() {
   for (unsigned char i = 0; i < PIPED_REQUEST_COMMANDS_TO_SEND_SIZE; i++) {
      char *command = piped_request_commands_to_send[i];
      if (command != NULL) {
         free(command);
         piped_request_commands_to_send[i] = NULL;
      }
   }
}

void connect_to_server() {
   if (piped_request_commands_to_send[PIPED_REQUEST_CIPSTART_COMMAND_INDEX] == NULL) {
      return;
   }

   send_usard_data(piped_request_commands_to_send[PIPED_REQUEST_CIPSTART_COMMAND_INDEX]);
   set_flag(&sent_flag, CONNECT_TO_SERVER_FLAG);
}

