hammer-dp-ua/WiFiMotionDetector-STM32/app/main.c
void set_bytes_amount_to_send() {
   if (piped_request_commands_to_send[PIPED_REQUEST_CIPSEND_COMMAND_INDEX] == NULL) {
      return;
   }

   send_usard_data(piped_request_commands_to_send[PIPED_REQUEST_CIPSEND_COMMAND_INDEX]);
   set_flag(&sent_flag, BYTES_TO_SEND_IN_REQUEST_IS_SET_FLAG);
}

void send_request() {
   if (piped_request_commands_to_send[PIPED_REQUEST_INDEX] == NULL) {
      return;
   }

   send_usard_data(piped_request_commands_to_send[PIPED_REQUEST_INDEX]);
   set_flag(&sent_flag, GET_REQUEST_SENT_AND_RESPONSE_RECEIVED_FLAG);
}

void set_appropriate_successfully_recieved_flag() {
   if (read_flag_state(&sent_flag, DISABLE_ECHO_FLAG)) {
      reset_flag(&sent_flag, DISABLE_ECHO_FLAG);

      if (is_usart_response_contains_element(USART_OK)) {
         set_flag(&successfully_received_flags, DISABLE_ECHO_FLAG);
      } else {
         send_usart_data_errors_counter++;
      }
   }
   if (read_flag_state(&sent_flag, GET_VISIBLE_NETWORK_LIST_FLAG)) {
      reset_flag(&sent_flag, GET_VISIBLE_NETWORK_LIST_FLAG);

      if (is_usart_response_contains_element(DEFAULT_ACCESS_POINT_NAME)) {
         set_flag(&successfully_received_flags, GET_VISIBLE_NETWORK_LIST_FLAG);
      } else {
         send_usart_data_errors_counter++;
      }
   }
   if (read_flag_state(&sent_flag, CONNECT_TO_NETWORK_FLAG)) {
      reset_flag(&sent_flag, CONNECT_TO_NETWORK_FLAG);

      if (is_usart_response_contains_element(USART_OK)) {
         set_flag(&successfully_received_flags, CONNECT_TO_NETWORK_FLAG);
      } else {
         send_usart_data_errors_counter++;
      }
   }
   if (read_flag_state(&sent_flag, OBTAIN_CONNECTION_STATUS_FLAG)) {
      reset_flag(&sent_flag, OBTAIN_CONNECTION_STATUS_FLAG);

      if (is_usart_response_contains_element(DEFAULT_ACCESS_POINT_NAME) ||
            is_usart_response_contains_element(ESP8226_RESPONSE_NOT_CONNECTED_STATUS)) {
         set_flag(&successfully_received_flags, OBTAIN_CONNECTION_STATUS_FLAG);
      } else {
         send_usart_data_errors_counter++;
      }
   }
   if (read_flag_state(&sent_flag, CONNECT_TO_SERVER_FLAG)) {
      reset_flag(&sent_flag, CONNECT_TO_SERVER_FLAG);

      char *data_to_be_contained[] = {ESP8226_RESPONSE_CONNECTED, USART_OK};
      if (is_usart_response_contains_elements(data_to_be_contained, 2) ||
            is_usart_response_contains_element(ESP8226_RESPONSE_ALREADY_CONNECTED)) {
         set_flag(&successfully_received_flags, CONNECT_TO_SERVER_FLAG);
      } else {
         send_usart_data_errors_counter++;
      }
   }
   if (read_flag_state(&sent_flag, BYTES_TO_SEND_IN_REQUEST_IS_SET_FLAG)) {
      reset_flag(&sent_flag, BYTES_TO_SEND_IN_REQUEST_IS_SET_FLAG);

      if (is_usart_response_contains_element(ESP8226_RESPONSE_START_SENDING_READY)) {
         set_flag(&successfully_received_flags, BYTES_TO_SEND_IN_REQUEST_IS_SET_FLAG);
      } else {
         send_usart_data_errors_counter++;
      }
   }
   if (read_flag_state(&sent_flag, GET_REQUEST_SENT_AND_RESPONSE_RECEIVED_FLAG)) {
      reset_flag(&sent_flag, GET_REQUEST_SENT_AND_RESPONSE_RECEIVED_FLAG);

      char *data_to_be_contained[] = {ESP8226_RESPONSE_SUCCSESSFULLY_SENT, ESP8226_RESPONSE_PREFIX};
      if (is_usart_response_contains_elements(data_to_be_contained, 2)) {
         set_flag(&successfully_received_flags, GET_REQUEST_SENT_AND_RESPONSE_RECEIVED_FLAG);

         usart_overrun_errors_counter_prev = usart_overrun_errors_counter;
         usart_idle_line_detection_counter_prev = usart_idle_line_detection_counter;
         usart_noise_detection_counter_prev = usart_noise_detection_counter;
         usart_framing_errors_counter_prev = usart_framing_errors_counter;
      } else {
         send_usart_data_errors_counter++;
      }
   }
   if (read_flag_state(&sent_flag, GET_CURRENT_DEFAULT_WIFI_MODE_FLAG)) {
      reset_flag(&sent_flag, GET_CURRENT_DEFAULT_WIFI_MODE_FLAG);

      if (is_usart_response_contains_element(ESP8226_RESPONSE_WIFI_MODE_PREFIX)) {
         set_flag(&successfully_received_flags, GET_CURRENT_DEFAULT_WIFI_MODE_FLAG);
      } else {
         send_usart_data_errors_counter++;
      }
   }
   if (read_flag_state(&sent_flag, SET_DEFAULT_STATION_WIFI_MODE_FLAG)) {
      reset_flag(&sent_flag, SET_DEFAULT_STATION_WIFI_MODE_FLAG);

      if (is_usart_response_contains_element(USART_OK)) {
         set_flag(&successfully_received_flags, SET_DEFAULT_STATION_WIFI_MODE_FLAG);
      } else {
         send_usart_data_errors_counter++;
      }
   }
}

void on_successfully_receive_general_actions(unsigned short successfully_received_flag) {
   if (successfully_received_flag) {
      reset_flag(&successfully_received_flags, successfully_received_flag);
   }
   send_usart_data_function = NULL;
   send_usart_data_errors_counter = 0;
   remove_current_piped_task_to_send();
}

unsigned short get_current_piped_task_to_send() {
   return piped_tasks_to_send[0];
}

void remove_current_piped_task_to_send() {
   for (unsigned char i = 0; piped_tasks_to_send[i] != 0; i++) {
      unsigned short next_task = piped_tasks_to_send[i + 1];
      piped_tasks_to_send[i] = next_task;
   }
}

void add_piped_task_to_send_into_tail(unsigned short task) {
   for (unsigned char i = 0; i < 10; i++) {
      if (piped_tasks_to_send[i] == 0) {
         piped_tasks_to_send[i] = task;
         break;
      }
   }
}

void add_piped_task_to_send_into_head(unsigned short task) {
   for (unsigned char i = 10 - 1; i != 0; i--) {
      piped_tasks_to_send[i] = piped_tasks_to_send[i - 1];
   }
   piped_tasks_to_send[0] = task;
}

void delete_all_piped_tasks() {
   for (unsigned char i = 0; i < 10; i++) {
     piped_tasks_to_send[i] = 0;
   }
}

unsigned char is_usart_response_contains_element(char string_to_be_contained[]) {
   if (contains_string(usart_data_received_buffer, string_to_be_contained)) {
      return 1;
   } else {
      return 0;
   }
}

//char *data_to_be_contained[] = {ESP8226_REQUEST_DISABLE_ECHO, USART_OK};
unsigned char is_usart_response_contains_elements(char *data_to_be_contained[], unsigned char elements_count) {
   for (unsigned char elements_index = 0; elements_index < elements_count; elements_index++) {
      if (!contains_string(usart_data_received_buffer, data_to_be_contained[elements_index])) {
         return 0;
      }
   }
   return 1;
}

