hammer-dp-ua/WiFiMotionDetector-STM32/app/main.c
   USART_DMACmd(USART1, USART_DMAReq_Tx, ENABLE);

   USART_Cmd(USART1, ENABLE);
}

void set_flag(unsigned int *flags, unsigned int flag_value) {
   *flags |= flag_value;
}

void reset_flag(unsigned int *flags, unsigned int flag_value) {
   *flags &= ~(*flags & flag_value);
}

unsigned char read_flag_state(unsigned int *flags, unsigned int flag_value) {
   return (*flags & flag_value) > 0 ? 1 : 0;
}

void send_usard_data(char *string) {
   clear_usart_data_received_buffer();
   DMA_Cmd(USART1_TX_DMA_CHANNEL, DISABLE);
   unsigned char bytes_to_send = get_string_length(string);

   if (bytes_to_send == 0) {
      return;
   }

   DMA_SetCurrDataCounter(USART1_TX_DMA_CHANNEL, bytes_to_send);
   USART1_TX_DMA_CHANNEL->CMAR = (unsigned int) string;
   USART_ClearFlag(USART1, USART_FLAG_TC);
   DMA_Cmd(USART1_TX_DMA_CHANNEL, ENABLE);
}

/**
 * Supports only 9 parameters (1 - 9). Do not forget to call free() function on returned pointer when it's no longer needed
 *
 * *parameters array of pointers to strings. The last parameter has to be NULL
 */
void *set_string_parameters(char string[], char *parameters[]) {
   unsigned char open_brace_found = 0;
   unsigned char parameters_length = 0;
   unsigned short result_string_length = 0;

   for (; parameters[parameters_length] != NULL; parameters_length++) {
   }

   // Calculate the length without symbols to be replaced ('{x}')
   for (char *string_pointer = string; *string_pointer != '\0'; string_pointer++) {
      if (*string_pointer == '{') {
         if (open_brace_found) {
            return NULL;
         }
         open_brace_found = 1;
         continue;
      }
      if (*string_pointer == '}') {
         if (!open_brace_found) {
            return NULL;
         }
         open_brace_found = 0;
         continue;
      }
      if (open_brace_found) {
         continue;
      }

      result_string_length++;
   }

   if (open_brace_found) {
      return NULL;
   }

   for (unsigned char i = 0; parameters[i] != NULL; i++) {
      result_string_length += get_string_length(parameters[i]);
   }
   // 1 is for the last \0 character
   result_string_length++;

   char *allocated_result;
   allocated_result = malloc(result_string_length); // (string_length + 1) * sizeof(char)

   if (allocated_result == NULL) {
      return NULL;
   }

   unsigned char result_string_index = 0, input_string_index = 0;
   for (; result_string_index < result_string_length - 1; result_string_index++) {
      char input_string_symbol = string[input_string_index];

      if (input_string_symbol == '{') {
         input_string_index++;
         input_string_symbol = string[input_string_index] ;

         if (input_string_symbol < '1' || input_string_symbol > '9') {
            return NULL;
         }

         input_string_symbol -= 48; // Now it's not allocated_result char character, but allocated_result number
         if (input_string_symbol > parameters_length) {
            return NULL;
         }
         input_string_index += 2;

         // Parameters are starting with 1
         char *parameter = parameters[input_string_symbol - 1];

         for (; *parameter != '\0'; parameter++, result_string_index++) {
            *(allocated_result + result_string_index) = *parameter;
         }
         result_string_index--;
      } else {
         *(allocated_result + result_string_index) = string[input_string_index];
         input_string_index++;
      }
   }
   *(allocated_result + result_string_length - 1) = '\0';
   return allocated_result;
}

unsigned short get_string_length(char string[]) {
   unsigned short length = 0;

   for (char *string_pointer = string; *string_pointer != '\0'; string_pointer++, length++) {
   }
   return length;
}

void *short_to_string(unsigned short number) {
   if (number == 0) {
      return "0";
   }

   unsigned short remaining = number;
   unsigned short divider = 10000;
   unsigned char string_length = 0;
   char *result_string_pointer = NULL;

   for (unsigned char string_index = 5; string_index > 0; string_index--, divider /= 10) {
      char result_character = (char)(remaining / divider);

      if (result_string_pointer == NULL && result_character) {
         result_string_pointer = malloc(string_index + 1);
         string_length = string_index;
      }
      if (result_string_pointer != NULL) {
         unsigned char index = string_length - string_index;
         *(result_string_pointer + index) = result_character + 48;
      }

      remaining -= result_character * divider;
   }
   result_string_pointer[string_length] = '\0';
   return result_string_pointer;
}

void clear_usart_data_received_buffer() {
   for (int i = 0; i < USART_DATA_RECEIVED_BUFFER_SIZE; i++) {
      if (usart_data_received_buffer[i] == '\0') {
         break;
      }

      usart_data_received_buffer[i] = '\0';
   }
}

void enable_esp8266() {
   GPIO_WriteBit(GPIOA, GPIO_Pin_12, Bit_RESET);
   esp8266_disabled_timer = TIMER6_5S;
}

void disable_esp8266() {
   GPIO_WriteBit(GPIOA, GPIO_Pin_12, Bit_SET);
}

unsigned char is_esp8266_enabled(unsigned char include_timer) {
   return include_timer ? (!GPIO_ReadOutputDataBit(GPIOA, GPIO_Pin_12) && esp8266_disabled_timer == 0) :
         !GPIO_ReadOutputDataBit(GPIOA, GPIO_Pin_12);
}
